# Dodavanje nepozeljnog teksta

import json
import string
import cyrtranslit

#prekopirajte naslov i sadrzaj dole

naslov = 'У светоме Писму ми не налазимо изричнога мјеста'

sadrzaj = '''
Да видимо шта о пуноћи епископске благодати каже свети Јустин Поповић: „Епископски чин је најглавнији, јер епископ има пуноћу благодати свештенства Он не само има право да врши све свете тајне, и да освећује свето миро, него има власт да путем рукоположења даје и другима благодат за вршење светих тајни. Епископ је у својој области (епархији) врховни учитељ вере и врховни старешина над свима хришћанима.“

Међутим, у историји Цркве имамо и примјере када су епископи, да би Цркву спасили или одбранили од насртаја јереси и лажних учитеља, чак и постављали епископе.

У «Споменици древне хришћанске Цркве» (1 том, стр. 55 и 56 изд. 1829 г. на руском) постоји овакво свједочанство: «Пошто је аријанство угрожавало Цркву, Атанасије Велики, вративши се из заточништва, у разним градовима, кроз које је пролазио, иако они нијесу били у његовој епархији, је рукополагао не обзирући се; то је исто чинио свети Јевсевије Самосатски у вријеме гоњења од аријанаца при Валенту. Он је, по свједочанству Теодорита, одјевен у војну одјећу, прошао сву Сирију, Финикију и Палестину, рукополажући свештенике и ђаконе, постављајући их на више црквене степене, и сређујући све настале беспоретке у црквама. На исти начин у Сирији, Киликији и другим мјестима, које набраја Теодорит, рукополагао је он епископе. Све је то било противно општим правилама, но било је неопходно ради реда у Цркви, која у таквим случајевима даје власт да поступају, као епископи у цијелој Васељенској Цркви».

Митрополит Кијевски Јов Борецки је 1620. године био рукоположен самостално од стране патријарха Јерусалимског Теофана, који је обновио у Малорусији православну јерархију које је нестало због гоњења унијата.

При том, Генадије Схоларије, патријарх Цариградски (1454 -1456), ученик св. Марка Ефеског који је живјео у времену распростирања уније на просторе православних, говори: „Увјеравам вас у Господу, да онај који у наше вријеме (прогона православних) тражи да се строго чувају сви обичаји и устави Цркве, како је то било у вријеме слободе хришћана, такав је непријатељ хришћанства, и полаже бреме на бесилне; а онај који развезује мало, да би сачувао цело, такав има дух апостолски“.

Треће питање – Настанак и развој институције хорепископа?

Овдје ћу на почетку одговорити текстом епископа Никодима Милаша гдје говори о настанку ове епископске титуле.

У светоме Писму ми не налазимо изричнога мјеста, из кога би се видело, да су хорепископи у апостолској цркви постојали. Околности цркве христјанске та дашњег доба допуштају нам ипак предполагати, да су хорепископи и у оно још доба били. Црква је тада била окружена са свију страна незнабожцима, које је требало усиљеним средствима просвјећивати евангелском науком. Није она слободна била ни од различитих јеретика, који, да успјешније дјелују у распростирању својих лажних наука, стараxу се да постављају једномишљенике своје у свима и најмањим мјестима за епископе и презвитере.

Противу једних и других, црква је морала усилити своју обрану, да побједу православљу и вјернима извојује :она је постављала у свакоме и најмањем мјесту православне епископе, препоручујући нам, да народ уздржују у чистој науци, да православни клир храбре у борби с непријатељима цркве и да свугдје достојне свештено и црквенослужитеље постављају. Епископи тих мањих мјеста или села називали су се обћим именом селских епископа, да се разликују од оних, који су у градовима били, од градския епископа. Власт ових у своме мјесту била је једнака власти градских епископа у својим градовима ; одношај пак између њих био је од прилике онај који је посље установљен између епи копа и првог епископа , — или, служећи се изразима каноничкима, власт хорепископа у своме округу била је једнака власти градског епископа у својој епархији, одношај између њих био је приблизно онај, што је постојао између епархијалних епископа и епископа митрополе .[4]

Први изричнији спомен о хорепископима налазимо у І посланици Климента Римског Кориићанима : Praedicantes per regiones ac urbes , primitias earum, spiritu cum probassent, in episcopos el diaconos eorum qui credturi erant, constituerunt . Евсевије у својој црквеној историји, говорећи о Антиохијскоме сабору противу Павла Самосатског, каже : Истим начином Он је допуштао себи проповједати народу и епископима оближњих градова и села, и презвитерима, који му ласкаxy“ . У опаскама на Евсевијеву историју руског издања, читамо на споменуте рјечи: „ Треба разумјевати сhогерiscopos , или селске епископе, који су митрополији подвластни били“ . Подобно овоме говори и латински издавач историје Евсевија : Chorepiscopos intelligеrе vіdеlur. Eosenim distinguit epistols ab Episcopis urbium „. Узимајући у обзир доба кад је Климент римски живио и време кад је држан сабор у Антиохији противу Павла Самосатског, о коме Евсевије спомиње, мора се сматрати погрјешном мисао Ind. Thomassin-a, који тврди : Chorepiscopos tria priora saecula habuisse nollos, eosque noviter institutos esse , quia non fuisse bis leinporibus in agris ecclesias constitutas. Не може се ово допустити ни с’ погледа на име јер епископи оближних села , о којима спомиње Евсевије, свакако сliorepiscopi или Episcopi rurales seu villani морају бити. Не може се устврдити ни то, да су тек сабори IV вјека хорепископе установили, јер начин, којим се у својим правилима ти сабори изражавају, показује, да су хорепископи у то доба били добро познати и њихов дјелокруг више или мање оцpњен. Установа хорепископа дакле односи се свакако у најстаријем добу цркве христјанске, ка временима апостола , или бар мужева апостолских. Сабори који о хорепископима говоре, јасно нам казују, да хорепископи не само што су се разликовали од презвитера, него су правим, само зависним ограниченом влашћу, епископима сматрани били.[5]

Касније, како је Црква јачала и улазила у један период стабилности и мира, губила се и потреба за хорепископима. У међувремену њихова власт је смањивана па су се тако касније престали и појављивати на саборима осим ако нијесу замјењивали свог епархијског епископа. 57. канон Лаодикијског и 6. канон Сардичког сабора који каже „ …Никако пак не треба постављати епископа у какво мало мјесто или мали град за који је довољан и један презвитер ,а не треба постављати у таквим мјестима епископа с тога, да се не омаловажи име и власт епископа.“

Међутим, како епископ Милаш каже у свом тумачењу овог правила „умножи ли се у неком мјесту народ и то се мјесто покаже да заслужује да у њему буде свој епископ, правило допушта да се ту постави такав епископ.“

Ове одредбе свакако нијесу потпуно искорјениле институцију хорепископа у Цркви те су они постављани и у даљим вијековима, у Кипарској цркви до 2014. године и у Епархији Рашко призренској у егзилу.

Коначно, да ли хорепископ може доћи на епархијски трон и да ли му за то требају нека додатна рукполагања?

'''


def filtriranje(naslov, sadrzaj):

    naslov = list(map(lambda a: a.strip('\u201e'), naslov.split()))
    naslov = list(map(lambda a: a.strip('\u201c'), naslov))
    naslov = list(map(lambda a: cyrtranslit.to_latin(a), naslov))
    naslov = ' '.join(naslov)
    
    sadrzaj = list(map(lambda a: a.strip('\u201a'), sadrzaj.split()))
    sadrzaj = list(map(lambda a: a.strip('\u201e'), sadrzaj))
    sadrzaj = list(map(lambda a: a.strip('\u201c'), sadrzaj))
    sadrzaj = list(map(lambda a: a.strip('\u201d'), sadrzaj))
    sadrzaj = list(map(lambda a: a.strip('\u2026'), sadrzaj))
    sadrzaj = list(map(lambda a: a.strip(string.punctuation + string.whitespace), sadrzaj))
    sadrzaj = list(map(lambda a: cyrtranslit.to_latin(a), sadrzaj))


    def kratke_reci(rec):
        if len(rec) > 3 or rec in ['bog',
                                   'oče',
                                   'oce',
                                   'mir',
                                   'duh',
                                   'sv.',
                                   'car',
                                   'sin',
                                   'pop',
                                   'moj']:
            return rec
            
    sadrzaj = list(filter(kratke_reci, sadrzaj))

    print(sadrzaj)
      
    return naslov, sadrzaj


if __name__ == '__main__':
    
    with open('database\\nepozeljni.json', 'r') as f:
        recnik = json.load(f)
        
    naslov, sadrzaj = filtriranje(naslov, sadrzaj)

    recnik[naslov] = sadrzaj
    
    with open('database\\nepozeljni.json', 'w') as f:
        json.dump(recnik, f, indent = 2)



